# 1. Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

import sys

hours, hour_rate, bonus = sys.argv[1:]


def zp_cals():
    return print((hours * hour_rate) + bonus)


zp_cals()
